{
  "irVersion": "1.0",
  "project": "multi-agent-spec",
  "repository": "https://github.com/plexusone/multi-agent-spec",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.7.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Organization rename from agentplexus to plexusone" }
      ],
      "changed": [
        { "description": "**Breaking**: GitHub organization renamed from `agentplexus` to `plexusone`" },
        { "description": "**Breaking**: Go module path changed from `github.com/agentplexus/multi-agent-spec` to `github.com/plexusone/multi-agent-spec`" },
        { "description": "**Breaking**: NPM package renamed from `@agentplexus/multi-agent-spec` to `@plexusone/multi-agent-spec`" },
        { "description": "JSON Schema `$id` URLs updated to new GitHub raw URLs" },
        { "description": "Documentation site URL changed to `plexusone.github.io/multi-agent-spec`" }
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2026-02-21",
      "highlights": [
        { "description": "Workflow categories: deterministic (chain, scatter, graph) and self-directed (crew, swarm, council)" },
        { "description": "Collaboration config for self-directed workflows with lead agents, task queues, and consensus rules" },
        { "description": "Message schema for inter-agent communication" },
        { "description": "MkDocs documentation site with Material theme" }
      ],
      "added": [
        { "description": "Message schema (`schema/message/message.schema.json`) for inter-agent messaging", "commit": "64ed179" },
        { "description": "Workflow categories: `deterministic` and `self-directed`", "commit": "b83c942" },
        { "description": "Workflow types: `chain`, `scatter`, `graph` (deterministic); `crew`, `swarm`, `council` (self-directed)", "commit": "b83c942" },
        { "description": "CollaborationConfig with `lead`, `specialists`, `task_queue`, `consensus`, `channels`", "commit": "b83c942" },
        { "description": "ConsensusRules with `required_agreement`, `max_rounds`, `tie_breaker`", "commit": "b83c942" },
        { "description": "Channel types: `direct`, `broadcast`, `pub-sub`", "commit": "b83c942" },
        { "description": "Agent role fields: `role`, `goal`, `backstory`", "commit": "b83c942" },
        { "description": "DelegationConfig with `allow_delegation`, `can_delegate_to`, `can_receive_from`", "commit": "b83c942" },
        { "description": "Team fields: `collaboration`, `self_claim`, `plan_approval`", "commit": "b83c942" },
        { "description": "Message types: delegate_work, ask_question, share_finding, request_approval, challenge, vote, etc.", "commit": "64ed179" }
      ],
      "changed": [
        { "description": "**Breaking**: Workflow types renamed - `sequential`→`chain`, `parallel`→`scatter`, `dag`→`graph`", "commit": "b83c942" },
        { "description": "Deployment schema: ClaudeCodeConfig adds `team_mode`, `teammate_mode`, `enable_teams`", "commit": "b83c942" },
        { "description": "Deployment schema: CrewAIConfig adds `allowDelegation`, `managerLlm`", "commit": "b83c942" }
      ],
      "documentation": [
        { "description": "MkDocs documentation site with Material theme", "commit": "9978085" },
        { "description": "Release notes for v0.1.0 through v0.6.0", "commit": "9978085" },
        { "description": "Complete agent.md with role fields and DelegationConfig", "commit": "8144273" },
        { "description": "Complete team.md with all workflow types and collaboration config", "commit": "9978085" },
        { "description": "Complete deployment.md with self-directed platform mappings", "commit": "8144273" },
        { "description": "Complete sdk/go.md with full API reference", "commit": "8144273" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-02-14",
      "highlights": [
        { "description": "Content blocks for rich report content (lists, tables, metrics, kv_pairs)" },
        { "description": "Narrative renderer for Pandoc-friendly Markdown output" },
        { "description": "mas CLI tool for rendering team reports" }
      ],
      "added": [
        { "description": "ContentBlock types: kv_pairs, list, table, text, metric", "commit": "2544aee" },
        { "description": "Constructor functions: NewKVPairsBlock, NewListBlock, NewTableBlock, NewTextBlock, NewMetricBlock", "commit": "2544aee" },
        { "description": "TeamReport: Title, SummaryBlocks, FooterBlocks, Summary, Conclusion fields", "commit": "2544aee" },
        { "description": "TeamSection: ContentBlocks, Narrative fields", "commit": "2544aee" },
        { "description": "NarrativeRenderer for Pandoc-friendly Markdown (PDF-ready)", "commit": "2544aee" },
        { "description": "LLM evaluation types: EvaluationType, LLMEvaluation, CombinedWeights, Issue, Severity, Effort", "commit": "14b27e6" },
        { "description": "LLM evaluation extension schema (llm-evaluation.schema.json)", "commit": "56fe55e" },
        { "description": "mas CLI: render subcommand with box and narrative formats", "commit": "5374bff" },
        { "description": "mas CLI: --validate flag for JSON Schema validation", "commit": "5374bff" }
      ],
      "changed": [
        { "description": "TeamSection.Tasks is now optional (can use ContentBlocks instead)", "commit": "2544aee" }
      ],
      "documentation": [
        { "description": "ENHANCEMENT-content-blocks.md - content block design and usage", "commit": "8dbc00d" },
        { "description": "ENHANCEMENT-render-cli.md - mas CLI documentation", "commit": "8dbc00d" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-01-25",
      "highlights": [
        { "description": "Schema codegen pipeline: Go types are now the source of truth" },
        { "description": "New deployment platforms: Gemini CLI, ADK Go, CrewAI, AutoGen" },
        { "description": "TypeScript SDK auto-generated from JSON Schema" }
      ],
      "added": [
        { "description": "Codegen pipeline: Go → JSON Schema → TypeScript/Zod", "commit": "3efe29e" },
        { "description": "`tools/generate/` - Go schema generator using invopop/jsonschema", "commit": "3efe29e" },
        { "description": "`sdk/typescript/scripts/generate-schemas.mjs` - TypeScript/Zod generator", "commit": "3efe29e" },
        { "description": "`Makefile` - Orchestrates full codegen pipeline", "commit": "3efe29e" },
        { "description": "New platforms: GeminiCLI, ADKGo, CrewAI, AutoGen with typed configs", "commit": "57cc235" },
        { "description": "RuntimeConfig, StepRuntime, RetryPolicy, ObservabilityConfig for deployment targets", "commit": "57cc235" },
        { "description": "Go SDK: JSONSchema() methods on enum types for proper schema generation", "commit": "3efe29e" },
        { "description": "Go SDK: Typed platform config fields on Target", "commit": "57cc235" },
        { "description": "Icon field in agent schema", "commit": "9e6fd52" }
      ],
      "changed": [
        { "description": "**Breaking (Go SDK)**: `Target.Config json.RawMessage` replaced with typed config fields", "commit": "57cc235" },
        { "description": "TypeScript SDK now auto-generated from JSON Schema", "commit": "3efe29e" },
        { "description": "JSON Schemas regenerated with proper enum values and descriptions", "commit": "3efe29e" }
      ],
      "removed": [
        { "description": "Go SDK: `Target.Config` field (use typed config fields instead)", "commit": "57cc235" },
        { "description": "TypeScript SDK: Manual `schemas.ts` (replaced by generated schemas)", "commit": "3efe29e" }
      ],
      "fixed": [
        { "description": "Report table alignment (boxWidth 76→78)", "commit": "d63e76a" },
        { "description": "Python SDK missing `__init__.py` files", "commit": "8416872" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-24",
      "highlights": [
        { "description": "Add namespace support for organizing agents into subdirectories" }
      ],
      "added": [
        { "description": "Optional `namespace` field in agent schema for organizing agents" },
        { "description": "Recursive directory scanning in `LoadAgentsFromDir` - agents in subdirectories get namespace from directory name" },
        { "description": "`LoadAgentsFromDirFlat` function for non-recursive loading (backward compatibility)" },
        { "description": "`LoadAgentFromFile`, `LoadTeamFromFile`, `LoadDeploymentFromFile` loader functions in Go SDK" },
        { "description": "`Namespace` field on Agent struct in Go SDK" },
        { "description": "`AllowedTools` field on Agent struct in Go SDK" },
        { "description": "`QualifiedName()` method on Agent to get `namespace/name` format" },
        { "description": "`ParseQualifiedName()` function to split qualified names" },
        { "description": "`WithNamespace()` builder method on Agent" },
        { "description": "YAML struct tags on all Agent fields" },
        { "description": "Support for `namespace/agent-name` references in team schema (agents, orchestrator, step.agent)" }
      ],
      "documentation": [
        { "description": "README section on nested agent directories with examples" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-17",
      "added": [
        { "description": "Tasks to agent schema with `id`, `description`, `type`, `command`, `pattern`, `file`, `required`, `expected_output`, `human_in_loop` fields", "commit": "3fd7604" },
        { "description": "DAG-aware topological sorting for team reports", "commit": "9c999e2" },
        { "description": "Team status report IR and renderer (NASA-style Go/No-Go validation)", "commit": "579ee6d" }
      ],
      "changed": [
        { "description": "Rename `checks` to `tasks` in report schema for consistency", "commit": "3fd7604" }
      ],
      "documentation": [
        { "description": "specs/ directory structure convention", "commit": "518a2b2" },
        { "description": "Installation section with Go SDK tagging notes", "commit": "70b7f1e" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Initial release with platform-agnostic agent definitions and multi-language SDKs" }
      ],
      "added": [
        { "description": "JSON schemas for agent, team, and deployment definitions", "commit": "ff347db" },
        { "description": "Go SDK with model/tool mappings for Claude Code, Kiro CLI, AWS Bedrock, and AgentKit", "commit": "ff347db" },
        { "description": "Python SDK with Pydantic models", "commit": "ff347db" },
        { "description": "TypeScript SDK with Zod schemas", "commit": "ff347db" },
        { "description": "Example stats-agent-team with multi-platform outputs", "commit": "ff347db" }
      ],
      "documentation": [
        { "description": "README with architecture overview, schemas, and usage examples", "commit": "ff347db" },
        { "description": "v0.1.0 release notes", "commit": "eafb9dd" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions CI workflow for Go SDK testing", "commit": "ff347db" },
        { "description": "GitHub Actions lint workflow with golangci-lint", "commit": "ff347db" },
        { "description": "CodeQL security scanning workflow", "commit": "ff347db" },
        { "description": "Dependabot configuration", "commit": "ff347db" }
      ],
      "fixed": [
        { "description": "CI workflows working-directory set to sdk/go", "commit": "df4f739" },
        { "description": "golangci-lint gofmt formatting", "commit": "a179ad7" }
      ]
    }
  ]
}
