{
  "irVersion": "1.0",
  "project": "multi-agent-spec/sdk/go",
  "repository": "https://github.com/plexusone/multi-agent-spec",
  "tagPath": "sdk/go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.8.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Organization rename from agentplexus to plexusone" }
      ],
      "changed": [
        { "description": "**Breaking**: Go module path changed from `github.com/agentplexus/multi-agent-spec/sdk/go` to `github.com/plexusone/multi-agent-spec/sdk/go`" }
      ],
      "migration": [
        { "description": "Update import paths: `import multiagentspec \"github.com/plexusone/multi-agent-spec/sdk/go\"`" },
        { "description": "Update go.mod: `go get github.com/plexusone/multi-agent-spec/sdk/go@v0.8.0`" }
      ]
    },
    {
      "version": "v0.7.0",
      "date": "2026-02-21",
      "highlights": [
        { "description": "Workflow categories: deterministic and self-directed paradigms" },
        { "description": "Self-directed workflow types: crew, swarm, council" },
        { "description": "Collaboration config, message types, and agent role fields" },
        { "description": "QuickTemplate-based rendering for box and narrative formats" }
      ],
      "added": [
        { "description": "`WorkflowCategory` type with `CategoryDeterministic` and `CategorySelfDirected`", "commit": "62a135a" },
        { "description": "`WorkflowType` constants: `WorkflowChain`, `WorkflowScatter`, `WorkflowGraph`, `WorkflowCrew`, `WorkflowSwarm`, `WorkflowCouncil`", "commit": "62a135a" },
        { "description": "`WorkflowType.Category()`, `IsDeterministic()`, `IsSelfDirected()` methods", "commit": "62a135a" },
        { "description": "`Team.Collaboration` field for self-directed workflow config", "commit": "62a135a" },
        { "description": "`Team.SelfClaim`, `Team.PlanApproval` convenience fields", "commit": "62a135a" },
        { "description": "`Team.Validate()` method for workflow-specific validation", "commit": "62a135a" },
        { "description": "`Team.WorkflowCategory()`, `IsDeterministic()`, `IsSelfDirected()`, `EffectiveLead()` methods", "commit": "62a135a" },
        { "description": "`Team.WithCollaboration()`, `WithSelfClaim()`, `WithPlanApproval()` builder methods", "commit": "62a135a" },
        { "description": "`CollaborationConfig` with `Lead`, `Specialists`, `TaskQueue`, `Consensus`, `Channels`", "commit": "214f5ff" },
        { "description": "`ConsensusRules` with `RequiredAgreement`, `MaxRounds`, `TieBreaker`", "commit": "214f5ff" },
        { "description": "`Channel` and `ChannelType` (direct, broadcast, pub-sub)", "commit": "214f5ff" },
        { "description": "`Message` type for inter-agent communication", "commit": "214f5ff" },
        { "description": "`MessageType` constants: `MsgDelegateWork`, `MsgAskQuestion`, `MsgShareFinding`, `MsgRequestApproval`, `MsgChallenge`, `MsgVote`, etc.", "commit": "214f5ff" },
        { "description": "`NewMessage()` constructor with auto-generated ID and timestamp", "commit": "214f5ff" },
        { "description": "`Message.IsBroadcast()` method", "commit": "214f5ff" },
        { "description": "`Agent.Role`, `Goal`, `Backstory` fields for self-directed workflows", "commit": "62a135a" },
        { "description": "`Agent.Delegation` field with `DelegationConfig`", "commit": "62a135a" },
        { "description": "`DelegationConfig` with `AllowDelegation`, `CanDelegateTo`, `CanReceiveFrom`", "commit": "62a135a" },
        { "description": "`Agent.CanDelegate()`, `CanDelegateTo()`, `CanReceiveFrom()` methods", "commit": "62a135a" },
        { "description": "`Agent.WithRole()`, `WithGoal()`, `WithBackstory()`, `WithDelegation()` builder methods", "commit": "62a135a" },
        { "description": "QuickTemplate-based rendering with `box.qtpl` and `narrative.qtpl`", "commit": "5a23428" },
        { "description": "`ClaudeCodeConfig.TeamMode`, `TeammateMode`, `EnableTeams` fields", "commit": "62a135a" },
        { "description": "`CrewAIConfig.AllowDelegation`, `ManagerLLM` fields", "commit": "62a135a" }
      ],
      "changed": [
        { "description": "**Breaking**: Workflow types renamed - `WorkflowSequential`→`WorkflowChain`, `WorkflowParallel`→`WorkflowScatter`, `WorkflowDAG`→`WorkflowGraph`", "commit": "62a135a" }
      ],
      "tests": [
        { "description": "Tests for `Message` types and constructors", "commit": "53070c7" },
        { "description": "Tests for `CollaborationConfig` and `ConsensusRules`", "commit": "53070c7" },
        { "description": "Tests for `Team.Validate()` with workflow-specific validation", "commit": "53070c7" },
        { "description": "Tests for workflow category methods", "commit": "53070c7" },
        { "description": "Tests for agent delegation methods", "commit": "53070c7" }
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2026-02-14",
      "highlights": [
        { "description": "Content blocks for rich report content (`list`, `table`, `metric`, `kv_pairs`, `text`)" },
        { "description": "`NarrativeRenderer` for Pandoc-friendly Markdown output" },
        { "description": "LLM evaluation types for hybrid rule + AI evaluation workflows" }
      ],
      "added": [
        { "description": "`ContentBlock`, `ContentBlockType`, `KVPair`, `ListItem` types", "commit": "2544aee" },
        { "description": "`NewKVPairsBlock()`, `NewListBlock()`, `NewTableBlock()`, `NewTextBlock()`, `NewMetricBlock()` constructors", "commit": "2544aee" },
        { "description": "`TeamReport.Title`, `SummaryBlocks`, `FooterBlocks`, `Summary`, `Conclusion` fields", "commit": "2544aee" },
        { "description": "`TeamReport.EffectiveTitle()` method for title defaulting", "commit": "2544aee" },
        { "description": "`TeamSection.ContentBlocks` field for rich team content", "commit": "2544aee" },
        { "description": "`TeamSection.Narrative` (`*NarrativeSection`) for prose content", "commit": "2544aee" },
        { "description": "`AgentResult.ContentBlocks` field", "commit": "2544aee" },
        { "description": "`NarrativeRenderer` for Pandoc-friendly Markdown output", "commit": "2544aee" },
        { "description": "`NarrativeSection` type with `Problem`, `Analysis`, `Recommendation` fields", "commit": "2544aee" },
        { "description": "`EvaluationType` enum: `rule`, `llm`, `combined`", "commit": "14b27e6" },
        { "description": "`LLMEvaluation` type with `score`, `confidence`, `reasoning`, `model`, `provider`", "commit": "14b27e6" },
        { "description": "`CombinedWeights` for hybrid rule + LLM scoring", "commit": "14b27e6" },
        { "description": "`Issue` type for detailed problem tracking", "commit": "14b27e6" },
        { "description": "`Severity` enum: `critical`, `major`, `minor`, `suggestion`", "commit": "14b27e6" },
        { "description": "`Effort` enum: `trivial`, `low`, `medium`, `high`", "commit": "14b27e6" },
        { "description": "Content block rendering in `Renderer` (`kv_pairs`, `list`, `table`, `text`, `metric`)", "commit": "2544aee" },
        { "description": "`ListItem.EffectiveIcon()` method for status-to-icon derivation", "commit": "2544aee" }
      ],
      "changed": [
        { "description": "`TeamSection.Tasks` is now optional (use `ContentBlocks` for flexible content)", "commit": "2544aee" },
        { "description": "`Renderer` supports `SummaryBlocks`, team `ContentBlocks`, and `FooterBlocks`", "commit": "2544aee" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-01-25",
      "highlights": [
        { "description": "Replace `Target.Config` with typed platform config fields (breaking change)" },
        { "description": "Add codegen support with `JSONSchema()` methods on enum types" }
      ],
      "added": [
        { "description": "`JSONSchema()` methods on `Model`, `Tool`, `TaskType`, `WorkflowType`, `Platform`, `Priority`, `DeploymentMode`, `PortType`, `Status` for proper JSON Schema generation", "commit": "3efe29e" },
        { "description": "Typed platform config fields on `Target`: `ClaudeCode`, `GeminiCLI`, `KiroCLI`, `ADKGo`, `CrewAI`, `AutoGen`, `AWSAgentCore`, `Kubernetes`, `DockerCompose`, `AgentKitLocal`", "commit": "57cc235" },
        { "description": "New platform constants: `PlatformGeminiCLI`, `PlatformADKGo`, `PlatformCrewAI`, `PlatformAutoGen`", "commit": "57cc235" },
        { "description": "New config types: `GeminiCLIConfig`, `ADKGoConfig`, `CrewAIConfig`, `AutoGenConfig`, `CodeExecutionConfig`", "commit": "57cc235" },
        { "description": "Tests for all new platform configs", "commit": "57cc235" }
      ],
      "changed": [
        { "description": "**Breaking**: `Target.Config json.RawMessage` replaced with typed config fields - use `target.ClaudeCode = &ClaudeCodeConfig{...}` instead of `target.Config = json.Marshal(...)`", "commit": "57cc235" }
      ],
      "removed": [
        { "description": "`Target.Config` field (use typed config fields instead)", "commit": "57cc235" }
      ]
    },
    {
      "version": "v0.4.1",
      "date": "2026-01-24",
      "fixed": [
        { "description": "Report table alignment - update `boxWidth` from 76 to 78 for proper 80-character terminal width", "commit": "d63e76a" }
      ],
      "added": [
        { "description": "`Icon` field on `Agent` struct", "commit": "9e6fd52" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-01-24",
      "highlights": [
        { "description": "Add namespace support, file loaders, and YAML parsing for agent definitions" }
      ],
      "added": [
        { "description": "`Namespace` field on Agent struct for organizing agents into subdirectories" },
        { "description": "`AllowedTools` field on Agent struct for tools that execute without confirmation" },
        { "description": "`WithNamespace()` builder method on Agent" },
        { "description": "`QualifiedName()` method returning `namespace/name` format" },
        { "description": "`ParseQualifiedName()` function to split qualified agent names" },
        { "description": "`LoadAgentFromFile()` to load Agent from markdown with YAML frontmatter" },
        { "description": "`ParseAgentMarkdown()` to parse Agent from markdown bytes" },
        { "description": "`LoadAgentsFromDir()` with recursive scanning and namespace derivation from subdirectory" },
        { "description": "`LoadAgentsFromDirFlat()` for non-recursive loading (backward compatibility)" },
        { "description": "`LoadTeamFromFile()` to load Team from JSON" },
        { "description": "`LoadDeploymentFromFile()` to load Deployment from JSON" },
        { "description": "YAML struct tags on all Agent fields" },
        { "description": "`gopkg.in/yaml.v3` dependency for frontmatter parsing" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Add typed ports for workflow data flow, runtime configuration, and support for new platforms (Gemini CLI, ADK Go, CrewAI, AutoGen)" }
      ],
      "added": [
        { "description": "`Task` and `TaskType` for agent task definitions", "commit": "c3ccefc" },
        { "description": "`Port` and `PortType` for typed workflow inputs/outputs", "commit": "c3ccefc" },
        { "description": "`DeploymentMode` enum (`single-process`, `multi-process`, `distributed`, `serverless`)", "commit": "c3ccefc" },
        { "description": "`RuntimeConfig`, `StepRuntime`, `RetryPolicy` for workflow execution", "commit": "c3ccefc" },
        { "description": "`ObservabilityConfig` for tracing, metrics, and logging", "commit": "c3ccefc" },
        { "description": "`GeminiCLIConfig` for Google Gemini CLI Assistant", "commit": "c3ccefc" },
        { "description": "`ADKGoConfig` for Google Agent Development Kit (Go)", "commit": "c3ccefc" },
        { "description": "`CrewAIConfig` for CrewAI multi-agent framework", "commit": "c3ccefc" },
        { "description": "`AutoGenConfig` for Microsoft AutoGen framework", "commit": "c3ccefc" },
        { "description": "`DockerComposeConfig` for local Docker deployment", "commit": "c3ccefc" },
        { "description": "`Requires` field on `Agent` for external tool dependencies", "commit": "c3ccefc" },
        { "description": "`Tasks` field on `Agent` for task definitions", "commit": "c3ccefc" }
      ],
      "changed": [
        { "description": "`Step.Inputs` changed from `map[string]string` to `[]Port`", "commit": "c3ccefc" },
        { "description": "`Step.Outputs` changed from `[]string` to `[]Port`", "commit": "c3ccefc" }
      ],
      "documentation": [
        { "description": "Add Deployment Modes and Runtime Configuration sections to README", "commit": "5fe2911" },
        { "description": "Add JSON Schema Guidelines for Go Compatibility section", "commit": "5fe2911" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Rename `Check` to `TaskResult` for consistency with multi-agent-spec task terminology" }
      ],
      "changed": [
        { "description": "Rename `Check` struct to `TaskResult`", "commit": "3fd7604" },
        { "description": "Rename `Checks` field to `Tasks` in `AgentResult` and `TeamSection`", "commit": "3fd7604" },
        { "description": "Add backward compatibility alias `Check = TaskResult`", "commit": "3fd7604" }
      ],
      "documentation": [
        { "description": "Add specs/ directory structure convention to README", "commit": "518a2b2" }
      ]
    },
    {
      "version": "v0.1.2",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Add DAG-aware topological sorting for team reports based on step dependencies" }
      ],
      "added": [
        { "description": "`TeamReport.SortByDAG()` method using Kahn's algorithm", "commit": "9c999e2" },
        { "description": "`DependsOn` field on `TeamSection` for DAG edges", "commit": "9c999e2" },
        { "description": "Alphabetical ordering at each DAG level for deterministic output", "commit": "9c999e2" }
      ]
    },
    {
      "version": "v0.1.1",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Add team status report IR and renderer for NASA-style Go/No-Go validation reports" }
      ],
      "added": [
        { "description": "`Status` type with `GO`, `WARN`, `NO-GO`, `SKIP` constants", "commit": "579ee6d" },
        { "description": "`Check` struct for individual validation results", "commit": "579ee6d" },
        { "description": "`AgentResult` struct for agent outputs with inputs/outputs", "commit": "579ee6d" },
        { "description": "`TeamSection` struct for report sections", "commit": "579ee6d" },
        { "description": "`TeamReport` struct with `project`, `version`, `phase`, `teams`", "commit": "579ee6d" },
        { "description": "`Renderer` for ASCII box-drawing report output", "commit": "579ee6d" },
        { "description": "`ComputeStatus()`, `IsGo()`, `FinalMessage()` helper methods", "commit": "579ee6d" },
        { "description": "`AggregateResults()` for combining `AgentResults` into `TeamReport`", "commit": "579ee6d" }
      ],
      "documentation": [
        { "description": "Add Installation section with Go SDK tagging notes to README", "commit": "70b7f1e" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Initial release of Go SDK for multi-agent-spec with type definitions and platform mappings" }
      ],
      "added": [
        { "description": "`Agent` struct with `Name`, `Description`, `Model`, `Tools`, `Skills`, `Dependencies`, `Instructions`", "commit": "ff347db" },
        { "description": "`Team` struct with `Name`, `Version`, `Agents`, `Orchestrator`, `Workflow`, `Context`", "commit": "ff347db" },
        { "description": "`Deployment` struct with `Team` and `Targets`", "commit": "ff347db" },
        { "description": "`Model` constants (`haiku`, `sonnet`, `opus`)", "commit": "ff347db" },
        { "description": "`Tool` constants (`WebSearch`, `WebFetch`, `Read`, `Write`, `Glob`, `Grep`, `Bash`, `Edit`, `Task`)", "commit": "ff347db" },
        { "description": "`Platform` constants for supported deployment targets", "commit": "ff347db" },
        { "description": "Platform-specific config structs (`ClaudeCode`, `KiroCLI`, `AWSAgentCore`, `Kubernetes`)", "commit": "ff347db" },
        { "description": "Model and tool mapping functions for cross-platform translation", "commit": "ff347db" },
        { "description": "Builder pattern methods (`NewAgent()`, `WithModel()`, `WithTools()`, etc.)", "commit": "ff347db" }
      ]
    }
  ]
}
