{
  "ir_version": "1.0",
  "project": "multi-agent-spec/sdk/go",
  "repository": "https://github.com/agentplexus/multi-agent-spec",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["agentplexus"],
  "releases": [
    {
      "version": "0.3.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Add typed ports for workflow data flow, runtime configuration, and support for new platforms (Gemini CLI, ADK Go, CrewAI, AutoGen)" }
      ],
      "added": [
        { "description": "Task and TaskType for agent task definitions", "commit": "c3ccefc" },
        { "description": "Port and PortType for typed workflow inputs/outputs", "commit": "c3ccefc" },
        { "description": "DeploymentMode enum (single-process, multi-process, distributed, serverless)", "commit": "c3ccefc" },
        { "description": "RuntimeConfig, StepRuntime, RetryPolicy for workflow execution", "commit": "c3ccefc" },
        { "description": "ObservabilityConfig for tracing, metrics, and logging", "commit": "c3ccefc" },
        { "description": "GeminiCLIConfig for Google Gemini CLI Assistant", "commit": "c3ccefc" },
        { "description": "ADKGoConfig for Google Agent Development Kit (Go)", "commit": "c3ccefc" },
        { "description": "CrewAIConfig for CrewAI multi-agent framework", "commit": "c3ccefc" },
        { "description": "AutoGenConfig for Microsoft AutoGen framework", "commit": "c3ccefc" },
        { "description": "DockerComposeConfig for local Docker deployment", "commit": "c3ccefc" },
        { "description": "Requires field on Agent for external tool dependencies", "commit": "c3ccefc" },
        { "description": "Tasks field on Agent for task definitions", "commit": "c3ccefc" }
      ],
      "changed": [
        { "description": "Step.Inputs changed from map[string]string to []Port", "commit": "c3ccefc" },
        { "description": "Step.Outputs changed from []string to []Port", "commit": "c3ccefc" }
      ],
      "documentation": [
        { "description": "Add Deployment Modes and Runtime Configuration sections to README", "commit": "5fe2911" },
        { "description": "Add JSON Schema Guidelines for Go Compatibility section", "commit": "5fe2911" }
      ]
    },
    {
      "version": "0.2.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Rename Check to TaskResult for consistency with multi-agent-spec task terminology" }
      ],
      "changed": [
        { "description": "Rename Check struct to TaskResult", "commit": "3fd7604" },
        { "description": "Rename Checks field to Tasks in AgentResult and TeamSection", "commit": "3fd7604" },
        { "description": "Add backward compatibility alias Check = TaskResult", "commit": "3fd7604" }
      ],
      "documentation": [
        { "description": "Add specs/ directory structure convention to README", "commit": "518a2b2" }
      ]
    },
    {
      "version": "0.1.2",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Add DAG-aware topological sorting for team reports based on step dependencies" }
      ],
      "added": [
        { "description": "TeamReport.SortByDAG() method using Kahn's algorithm", "commit": "9c999e2" },
        { "description": "DependsOn field on TeamSection for DAG edges", "commit": "9c999e2" },
        { "description": "Alphabetical ordering at each DAG level for deterministic output", "commit": "9c999e2" }
      ]
    },
    {
      "version": "0.1.1",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Add team status report IR and renderer for NASA-style Go/No-Go validation reports" }
      ],
      "added": [
        { "description": "Status type with GO, WARN, NO-GO, SKIP constants", "commit": "579ee6d" },
        { "description": "Check struct for individual validation results", "commit": "579ee6d" },
        { "description": "AgentResult struct for agent outputs with inputs/outputs", "commit": "579ee6d" },
        { "description": "TeamSection struct for report sections", "commit": "579ee6d" },
        { "description": "TeamReport struct with project, version, phase, teams", "commit": "579ee6d" },
        { "description": "Renderer for ASCII box-drawing report output", "commit": "579ee6d" },
        { "description": "ComputeStatus, IsGo, FinalMessage helper methods", "commit": "579ee6d" },
        { "description": "AggregateResults for combining AgentResults into TeamReport", "commit": "579ee6d" }
      ],
      "documentation": [
        { "description": "Add Installation section with Go SDK tagging notes to README", "commit": "70b7f1e" }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Initial release of Go SDK for multi-agent-spec with type definitions and platform mappings" }
      ],
      "added": [
        { "description": "Agent struct with Name, Description, Model, Tools, Skills, Dependencies, Instructions", "commit": "ff347db" },
        { "description": "Team struct with Name, Version, Agents, Orchestrator, Workflow, Context", "commit": "ff347db" },
        { "description": "Deployment struct with Team and Targets", "commit": "ff347db" },
        { "description": "Model constants (haiku, sonnet, opus)", "commit": "ff347db" },
        { "description": "Tool constants (WebSearch, WebFetch, Read, Write, Glob, Grep, Bash, Edit, Task)", "commit": "ff347db" },
        { "description": "Platform constants for supported deployment targets", "commit": "ff347db" },
        { "description": "Platform-specific config structs (ClaudeCode, KiroCLI, AWSAgentCore, Kubernetes)", "commit": "ff347db" },
        { "description": "Model and tool mapping functions for cross-platform translation", "commit": "ff347db" },
        { "description": "Builder pattern methods (NewAgent, WithModel, WithTools, etc.)", "commit": "ff347db" }
      ]
    }
  ]
}
